# PANDAS

In [ ]:
import pandas as pd

### Data Frames

##### To manually store data in a table, create a DataFrame

#### A DataFrame is a 2-dimensional data structure that can store data of different types (including characters, integers, floating point values, categorical data and more) in columns. It is similar to a spreadsheet.

In [ ]:
df = pd.DataFrame(
    {
        "Name" : [
            "Mr.Punjan Pandey",
            "Mr.Alex Huggs",
            "Mr.Virat Kohli",
            "Mr.Henry Ford"
        ],
        "Age":[18,59,35,40],
        "Sex":["male","male","male","male"],

    }
)
df

               Name  Age   Sex
0  Mr.Punjan Pandey   18  male
1     Mr.Alex Huggs   59  male
2    Mr.Virat Kohli   35  male
3     Mr.Henry Ford   40  male

### To Work with a particular DATA

In [ ]:
df["Age"]

0    18
1    59
2    35
3    40
Name: Age, dtype: int64

### Few ways of Working

In [ ]:


df.describe()

             Age
count   4.000000
mean   38.000000
std    16.872068
min    18.000000
25%    30.750000
50%    37.500000
75%    44.750000
max    59.000000

In [ ]:
df["Age"].max()

np.int64(59)

In [ ]:
df["Age"].min()

np.int64(18)

In [ ]:

df["Age"].mean()

np.float64(38.0)